export type CatalogNode = {
  id: string;
  title: string;
  children?: CatalogNode[];
};

export const tushareCatalog: CatalogNode[] = [
  {
    "id": "14",
    "title": "股票数据",
    "children": [
      {
        "id": "24",
        "title": "基础数据",
        "children": [
          {
            "id": "25",
            "title": "股票列表"
          },
          {
            "id": "329",
            "title": "每日股本（盘前）"
          },
          {
            "id": "26",
            "title": "交易日历"
          },
          {
            "id": "397",
            "title": "ST股票列表"
          },
          {
            "id": "423",
            "title": "ST风险警示板股票"
          },
          {
            "id": "398",
            "title": "沪深港通股票列表"
          },
          {
            "id": "100",
            "title": "股票曾用名"
          },
          {
            "id": "112",
            "title": "上市公司基本信息"
          },
          {
            "id": "193",
            "title": "上市公司管理层"
          },
          {
            "id": "194",
            "title": "管理层薪酬和持股"
          },
          {
            "id": "375",
            "title": "北交所新旧代码对照"
          },
          {
            "id": "123",
            "title": "IPO新股上市"
          },
          {
            "id": "262",
            "title": "股票历史列表"
          }
        ]
      },
      {
        "id": "15",
        "title": "行情数据",
        "children": [
          {
            "id": "27",
            "title": "历史日线"
          },
          {
            "id": "372",
            "title": "实时日线"
          },
          {
            "id": "370",
            "title": "历史分钟"
          },
          {
            "id": "374",
            "title": "实时分钟"
          },
          {
            "id": "457",
            "title": "A股实时分钟-日累计"
          },
          {
            "id": "144",
            "title": "周线行情"
          },
          {
            "id": "145",
            "title": "月线行情"
          },
          {
            "id": "146",
            "title": "复权行情"
          },
          {
            "id": "336",
            "title": "周/月线行情(每日更新)"
          },
          {
            "id": "365",
            "title": "周/月线复权行情(每日更新)"
          },
          {
            "id": "28",
            "title": "复权因子"
          },
          {
            "id": "32",
            "title": "每日指标"
          },
          {
            "id": "109",
            "title": "通用行情接口"
          },
          {
            "id": "183",
            "title": "每日涨跌停价格"
          },
          {
            "id": "214",
            "title": "每日停复牌信息"
          },
          {
            "id": "48",
            "title": "沪深股通十大成交股"
          },
          {
            "id": "255",
            "title": "备用行情"
          }
        ]
      },
      {
        "id": "16",
        "title": "财务数据",
        "children": [
          {
            "id": "33",
            "title": "利润表"
          },
          {
            "id": "36",
            "title": "资产负债表"
          },
          {
            "id": "44",
            "title": "现金流量表"
          },
          {
            "id": "45",
            "title": "业绩预告"
          },
          {
            "id": "46",
            "title": "业绩快报"
          },
          {
            "id": "103",
            "title": "分红送股数据"
          },
          {
            "id": "79",
            "title": "财务指标数据"
          },
          {
            "id": "80",
            "title": "财务审计意见"
          },
          {
            "id": "81",
            "title": "主营业务构成"
          },
          {
            "id": "162",
            "title": "财报披露日期表"
          }
        ]
      },
      {
        "id": "17",
        "title": "参考数据",
        "children": [
          {
            "id": "451",
            "title": "个股异常波动"
          },
          {
            "id": "452",
            "title": "个股严重异常波动"
          },
          {
            "id": "453",
            "title": "交易所重点提示证券"
          },
          {
            "id": "61",
            "title": "前十大股东"
          },
          {
            "id": "62",
            "title": "前十大流通股东"
          },
          {
            "id": "110",
            "title": "股权质押统计数据"
          },
          {
            "id": "111",
            "title": "股权质押明细数据"
          },
          {
            "id": "124",
            "title": "股票回购"
          },
          {
            "id": "160",
            "title": "限售股解禁"
          },
          {
            "id": "161",
            "title": "大宗交易"
          },
          {
            "id": "164",
            "title": "股票开户数据（停）"
          },
          {
            "id": "165",
            "title": "股票开户数据（旧）"
          },
          {
            "id": "166",
            "title": "股东人数"
          },
          {
            "id": "175",
            "title": "股东增减持"
          },
          {
            "id": "494",
            "title": "股票增发"
          }
        ]
      },
      {
        "id": "291",
        "title": "特色数据",
        "children": [
          {
            "id": "292",
            "title": "券商盈利预测数据"
          },
          {
            "id": "293",
            "title": "每日筹码及胜率"
          },
          {
            "id": "294",
            "title": "每日筹码分布"
          },
          {
            "id": "296",
            "title": "股票技术面因子"
          },
          {
            "id": "328",
            "title": "股票技术面因子(专业版）"
          },
          {
            "id": "353",
            "title": "股票开盘集合竞价数据"
          },
          {
            "id": "354",
            "title": "股票收盘集合竞价数据"
          },
          {
            "id": "364",
            "title": "神奇九转指标"
          },
          {
            "id": "399",
            "title": "AH股比价"
          },
          {
            "id": "275",
            "title": "机构调研数据"
          },
          {
            "id": "267",
            "title": "券商月度金股"
          }
        ]
      },
      {
        "id": "330",
        "title": "两融及转融通",
        "children": [
          {
            "id": "58",
            "title": "融资融券交易汇总"
          },
          {
            "id": "59",
            "title": "融资融券交易明细"
          },
          {
            "id": "326",
            "title": "融资融券标的（盘前）"
          },
          {
            "id": "332",
            "title": "转融券交易汇总(停）"
          },
          {
            "id": "331",
            "title": "转融资交易汇总"
          },
          {
            "id": "333",
            "title": "转融券交易明细(停）"
          },
          {
            "id": "334",
            "title": "做市借券交易汇总(停）"
          }
        ]
      },
      {
        "id": "342",
        "title": "资金流向数据",
        "children": [
          {
            "id": "170",
            "title": "个股资金流向"
          },
          {
            "id": "348",
            "title": "个股资金流向（THS）"
          },
          {
            "id": "349",
            "title": "个股资金流向（DC）"
          },
          {
            "id": "371",
            "title": "板块资金流向（THS)"
          },
          {
            "id": "343",
            "title": "行业资金流向（THS）"
          },
          {
            "id": "344",
            "title": "板块资金流向（DC）"
          },
          {
            "id": "345",
            "title": "大盘资金流向（DC）"
          }
        ]
      },
      {
        "id": "346",
        "title": "打板专题数据",
        "children": [
          {
            "id": "106",
            "title": "龙虎榜每日统计单"
          },
          {
            "id": "107",
            "title": "龙虎榜机构交易单"
          },
          {
            "id": "355",
            "title": "THS涨跌停榜单"
          },
          {
            "id": "298",
            "title": "涨跌停和炸板数据"
          },
          {
            "id": "356",
            "title": "涨停股票连板天梯"
          },
          {
            "id": "357",
            "title": "涨停最强板块统计"
          },
          {
            "id": "259",
            "title": "THS概念板块分类"
          },
          {
            "id": "260",
            "title": "THS概念板块行情"
          },
          {
            "id": "261",
            "title": "THS概念板块成分"
          },
          {
            "id": "362",
            "title": "DC概念板块分类"
          },
          {
            "id": "363",
            "title": "DC概念板块成分"
          },
          {
            "id": "382",
            "title": "DC概念板块行情"
          },
          {
            "id": "369",
            "title": "开盘竞价成交（当日）"
          },
          {
            "id": "311",
            "title": "市场游资最全名录"
          },
          {
            "id": "312",
            "title": "游资交易每日明细"
          },
          {
            "id": "320",
            "title": "THS热榜"
          },
          {
            "id": "321",
            "title": "DC热榜"
          },
          {
            "id": "376",
            "title": "TDX概念板块分类"
          },
          {
            "id": "377",
            "title": "TDX概念板块成分"
          },
          {
            "id": "378",
            "title": "TDX概念板块行情"
          },
          {
            "id": "347",
            "title": "榜单数据（KP）"
          },
          {
            "id": "351",
            "title": "题材成分（KP）"
          }
        ]
      }
    ]
  },
  {
    "id": "384",
    "title": "ETF专题",
    "children": [
      {
        "id": "385",
        "title": "ETF基本信息"
      },
      {
        "id": "386",
        "title": "ETF跟踪指数"
      },
      {
        "id": "416",
        "title": "ETF实时分钟"
      },
      {
        "id": "470",
        "title": "ETF实时分钟-日累计"
      },
      {
        "id": "387",
        "title": "ETF历史分钟"
      },
      {
        "id": "400",
        "title": "ETF实时日线"
      },
      {
        "id": "127",
        "title": "ETF日线行情"
      },
      {
        "id": "493",
        "title": "ETF当日集合竞价"
      },
      {
        "id": "199",
        "title": "ETF复权因子"
      },
      {
        "id": "491",
        "title": "ETF每日涨跌停价格"
      },
      {
        "id": "408",
        "title": "ETF份额规模"
      },
      {
        "id": "471",
        "title": "每日篮子组合(沪市PCF）"
      },
      {
        "id": "472",
        "title": "每日篮子组合(深市PCF）"
      },
      {
        "id": "454",
        "title": "ETF实时参考"
      },
      {
        "id": "460",
        "title": "指数公司公告"
      }
    ]
  },
  {
    "id": "93",
    "title": "指数专题",
    "children": [
      {
        "id": "94",
        "title": "指数基本信息"
      },
      {
        "id": "95",
        "title": "指数日线行情"
      },
      {
        "id": "403",
        "title": "指数实时日线"
      },
      {
        "id": "420",
        "title": "指数实时分钟"
      },
      {
        "id": "171",
        "title": "指数周线行情"
      },
      {
        "id": "419",
        "title": "指数历史分钟"
      },
      {
        "id": "172",
        "title": "指数月线行情"
      },
      {
        "id": "96",
        "title": "指数成分和权重"
      },
      {
        "id": "128",
        "title": "大盘指数每日指标"
      },
      {
        "id": "181",
        "title": "申万行业分类"
      },
      {
        "id": "335",
        "title": "申万行业成分（分级）"
      },
      {
        "id": "327",
        "title": "申万日线行情"
      },
      {
        "id": "417",
        "title": "申万实时行情"
      },
      {
        "id": "469",
        "title": "SW历史分钟"
      },
      {
        "id": "373",
        "title": "中信行业成分"
      },
      {
        "id": "308",
        "title": "中信行业指数日行情"
      },
      {
        "id": "211",
        "title": "国际主要指数"
      },
      {
        "id": "358",
        "title": "指数技术面因子(专业版)"
      },
      {
        "id": "215",
        "title": "沪深市场每日交易统计"
      },
      {
        "id": "268",
        "title": "深圳市场每日交易情况"
      },
      {
        "id": "498",
        "title": "美股恐慌指数行情"
      }
    ]
  },
  {
    "id": "18",
    "title": "公募基金",
    "children": [
      {
        "id": "19",
        "title": "基金列表"
      },
      {
        "id": "118",
        "title": "基金管理人"
      },
      {
        "id": "208",
        "title": "基金经理"
      },
      {
        "id": "462",
        "title": "基金业绩基准"
      },
      {
        "id": "207",
        "title": "基金规模"
      },
      {
        "id": "119",
        "title": "基金净值"
      },
      {
        "id": "120",
        "title": "基金分红"
      },
      {
        "id": "121",
        "title": "基金持仓"
      },
      {
        "id": "359",
        "title": "基金技术面因子(专业版)"
      }
    ]
  },
  {
    "id": "134",
    "title": "期货数据",
    "children": [
      {
        "id": "135",
        "title": "合约信息"
      },
      {
        "id": "467",
        "title": "期货交易日历"
      },
      {
        "id": "138",
        "title": "期货日线行情"
      },
      {
        "id": "492",
        "title": "期货复权行情"
      },
      {
        "id": "337",
        "title": "期货周/月线行情(每日更新)"
      },
      {
        "id": "340",
        "title": "实时分钟行情"
      },
      {
        "id": "140",
        "title": "仓单日报"
      },
      {
        "id": "141",
        "title": "每日结算参数"
      },
      {
        "id": "313",
        "title": "历史分钟行情"
      },
      {
        "id": "314",
        "title": "历史Tick行情"
      },
      {
        "id": "139",
        "title": "每日持仓排名"
      },
      {
        "id": "468",
        "title": "南华期货指数日线行情"
      },
      {
        "id": "495",
        "title": "期货交易所库存周报"
      },
      {
        "id": "496",
        "title": "标准仓单到期数量"
      },
      {
        "id": "497",
        "title": "期货交易参数"
      },
      {
        "id": "189",
        "title": "期货主力与连续合约"
      },
      {
        "id": "216",
        "title": "期货主要品种交易周报"
      },
      {
        "id": "368",
        "title": "期货合约涨跌停价格"
      }
    ]
  },
  {
    "id": "283",
    "title": "现货数据",
    "children": [
      {
        "id": "284",
        "title": "上海黄金基础信息"
      },
      {
        "id": "285",
        "title": "上海黄金现货日行情"
      }
    ]
  },
  {
    "id": "157",
    "title": "期权数据",
    "children": [
      {
        "id": "158",
        "title": "期权合约信息"
      },
      {
        "id": "159",
        "title": "期权日线行情"
      },
      {
        "id": "341",
        "title": "期权分钟行情"
      }
    ]
  },
  {
    "id": "184",
    "title": "债券专题",
    "children": [
      {
        "id": "185",
        "title": "可转债基础信息"
      },
      {
        "id": "186",
        "title": "可转债发行"
      },
      {
        "id": "269",
        "title": "可转债赎回信息"
      },
      {
        "id": "305",
        "title": "可转债票面利率"
      },
      {
        "id": "187",
        "title": "可转债行情"
      },
      {
        "id": "459",
        "title": "可转债十大持有人"
      },
      {
        "id": "392",
        "title": "可转债技术面因子(专业版)"
      },
      {
        "id": "246",
        "title": "可转债转股价变动"
      },
      {
        "id": "247",
        "title": "可转债转股结果"
      },
      {
        "id": "458",
        "title": "可转债债券评级"
      },
      {
        "id": "256",
        "title": "债券回购日行情"
      },
      {
        "id": "322",
        "title": "柜台流通式债券报价"
      },
      {
        "id": "323",
        "title": "柜台流通式债券最优报价"
      },
      {
        "id": "271",
        "title": "大宗交易"
      },
      {
        "id": "272",
        "title": "大宗交易明细"
      },
      {
        "id": "201",
        "title": "国债收益率曲线"
      },
      {
        "id": "233",
        "title": "全球财经事件"
      }
    ]
  },
  {
    "id": "177",
    "title": "外汇数据",
    "children": [
      {
        "id": "178",
        "title": "外汇基础信息（海外）"
      },
      {
        "id": "179",
        "title": "外汇日线行情"
      }
    ]
  },
  {
    "id": "190",
    "title": "港股数据",
    "children": [
      {
        "id": "191",
        "title": "港股基础信息"
      },
      {
        "id": "250",
        "title": "港股交易日历"
      },
      {
        "id": "192",
        "title": "港股日线行情"
      },
      {
        "id": "339",
        "title": "港股复权行情"
      },
      {
        "id": "401",
        "title": "港股复权因子"
      },
      {
        "id": "304",
        "title": "港股分钟行情"
      },
      {
        "id": "383",
        "title": "港股实时日线"
      },
      {
        "id": "389",
        "title": "港股利润表"
      },
      {
        "id": "390",
        "title": "港股资产负债表"
      },
      {
        "id": "391",
        "title": "港股现金流量表"
      },
      {
        "id": "388",
        "title": "港股财务指标数据"
      }
    ]
  },
  {
    "id": "251",
    "title": "美股数据",
    "children": [
      {
        "id": "252",
        "title": "美股基础信息"
      },
      {
        "id": "253",
        "title": "美股交易日历"
      },
      {
        "id": "254",
        "title": "美股日线行情"
      },
      {
        "id": "338",
        "title": "美股复权行情"
      },
      {
        "id": "402",
        "title": "美股复权因子"
      },
      {
        "id": "394",
        "title": "美股利润表"
      },
      {
        "id": "395",
        "title": "美股资产负债表"
      },
      {
        "id": "396",
        "title": "美股现金流量表"
      },
      {
        "id": "393",
        "title": "美股财务指标数据"
      }
    ]
  },
  {
    "id": "147",
    "title": "宏观经济",
    "children": [
      {
        "id": "224",
        "title": "国内宏观",
        "children": [
          {
            "id": "461",
            "title": "中国经济数据发布日程"
          },
          {
            "id": "148",
            "title": "利率数据",
            "children": [
              {
                "id": "149",
                "title": "Shibor利率"
              },
              {
                "id": "150",
                "title": "Shibor报价数据"
              },
              {
                "id": "151",
                "title": "LPR贷款基础利率"
              },
              {
                "id": "152",
                "title": "Libor利率"
              },
              {
                "id": "153",
                "title": "Hibor利率"
              },
              {
                "id": "173",
                "title": "温州民间借贷利率"
              },
              {
                "id": "174",
                "title": "广州民间借贷利率"
              }
            ]
          },
          {
            "id": "225",
            "title": "国民经济",
            "children": [
              {
                "id": "227",
                "title": "国内生产总值（GDP）"
              }
            ]
          },
          {
            "id": "226",
            "title": "价格指数",
            "children": [
              {
                "id": "228",
                "title": "居民消费价格指数（CPI）"
              },
              {
                "id": "245",
                "title": "工业生产者出厂价格指数（PPI）"
              }
            ]
          },
          {
            "id": "240",
            "title": "金融",
            "children": [
              {
                "id": "241",
                "title": "货币供应量",
                "children": [
                  {
                    "id": "242",
                    "title": "货币供应量（月）"
                  }
                ]
              },
              {
                "id": "309",
                "title": "社会融资",
                "children": [
                  {
                    "id": "310",
                    "title": "社融增量（月度）"
                  }
                ]
              }
            ]
          },
          {
            "id": "324",
            "title": "景气度",
            "children": [
              {
                "id": "325",
                "title": "采购经理指数（PMI）"
              }
            ]
          }
        ]
      },
      {
        "id": "217",
        "title": "国际宏观",
        "children": [
          {
            "id": "218",
            "title": "美国利率",
            "children": [
              {
                "id": "219",
                "title": "国债收益率曲线利率"
              },
              {
                "id": "220",
                "title": "国债实际收益率曲线利率"
              },
              {
                "id": "221",
                "title": "短期国债利率"
              },
              {
                "id": "222",
                "title": "国债长期利率"
              },
              {
                "id": "223",
                "title": "国债长期利率平均值"
              }
            ]
          }
        ]
      }
    ]
  },
  {
    "id": "142",
    "title": "大模型语料",
    "children": [
      {
        "id": "406",
        "title": "国家政策库"
      },
      {
        "id": "415",
        "title": "券商研究报告"
      },
      {
        "id": "465",
        "title": "央行货币政策执行报告"
      },
      {
        "id": "143",
        "title": "新闻快讯（短讯）"
      },
      {
        "id": "195",
        "title": "新闻通讯（长篇）"
      },
      {
        "id": "154",
        "title": "新闻联播文字稿"
      },
      {
        "id": "176",
        "title": "上市公司公告"
      },
      {
        "id": "366",
        "title": "上证e互动问答"
      },
      {
        "id": "367",
        "title": "深证易互动问答"
      }
    ]
  },
  {
    "id": "485",
    "title": "量化因子库",
    "children": [
      {
        "id": "486",
        "title": "因子列表"
      },
      {
        "id": "490",
        "title": "因子数据"
      }
    ]
  },
  {
    "id": "474",
    "title": "自选组合",
    "children": [
      {
        "id": "446",
        "title": "组合列表"
      },
      {
        "id": "449",
        "title": "成分查询"
      },
      {
        "id": "445",
        "title": "组合保存"
      },
      {
        "id": "447",
        "title": "组合删除"
      }
    ]
  }
];
